title: OS Credential Dumping - T1003
id: ba37b983-3571-4968-b36d-7d06846ca4df
status: experimental
description: Detects execution of known credential dumping tools targeting LSASS or SAM based on CERG Detection Engineering Framework
references:
  - https://attack.mitre.org/techniques/T1003/
author: CERG Detection Engineering Team
date: 2026-06-30
modified: 2026-06-30
tags:
  - attack.t1003
  - attack.os_credential_dumping
  - attack.credential-access
  - attack.t1003.001
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
    Image|endswith:
      - '\procdump.exe'
      - '\procdump64.exe'
      - '\mimikatz.exe'
  selection_cli:
    CommandLine|contains:
      - 'sekurlsa::logonPasswords'
      - '-ma lsass'
      - 'comsvcs.dll #24'
      - 'MiniDump'
  condition: selection_img or selection_cli
falsepositives:
  - 'Forensic investigators performing legitimate memory analysis'
  - 'Approved EDR/Linux cross-platform tooling'
level: critical
