title: Command and Scripting Interpreter - T1059
id: a7aa39cd-e0b5-464c-9848-3dbbc76511ba
status: experimental
description: Detects PowerShell execution with suspicious parameters commonly used by attackers based on CERG Detection Engineering Framework
references:
  - https://attack.mitre.org/techniques/T1059/
author: CERG Detection Engineering Team
date: 2026-06-30
modified: 2026-06-30
tags:
  - attack.t1059
  - attack.command_and_scripting_interpreter
  - attack.execution
  - attack.t1059.001
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: '\powershell.exe'
    CommandLine|contains:
      - '-EncodedCommand'
      - '-ExecutionPolicy Bypass'
      - 'IEX ('
      - 'Invoke-Expression'
      - 'DownloadString'
      - '-WindowStyle Hidden'
      - '-NoProfile'
  condition: selection
falsepositives:
  - 'IT automation and deployment scripts (SCCM, PDQ, Ansible)'
  - 'Approved administrative tooling'
level: high
