title: Scheduled Task/Job - T1053
id: b40bd639-6c80-413a-95eb-b5922978fa4e
status: experimental
description: Detects creation of scheduled tasks, especially those executing scripts as a persistence mechanism based on CERG Detection Engineering Framework
references:
  - https://attack.mitre.org/techniques/T1053/
author: CERG Detection Engineering Team
date: 2026-06-30
modified: 2026-06-30
tags:
  - attack.t1053
  - attack.scheduled_task_job
  - attack.execution
  - attack.persistence
  - attack.t1053.005
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    EventID: 4698
  filter_microsoft:
    TaskName|startswith: 'Microsoft\Windows\'
  condition: selection and not filter_microsoft
falsepositives:
  - 'Software installers creating update tasks'
  - 'IT management tools (SCCM, GPO scheduling)'
level: medium
