title: Permission Groups Discovery - T1069
id: e2ac710d-ee19-4f9d-89af-2ef1b0a23e97
status: experimental
description: Detects enumeration of local or domain admin groups for discovery purposes based on CERG Detection Engineering Framework
references:
  - https://attack.mitre.org/techniques/T1069/
author: CERG Detection Engineering Team
date: 2026-06-30
modified: 2026-06-30
tags:
  - attack.t1069
  - attack.permission_groups_discovery
  - attack.discovery
  - attack.t1069.002
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains:
      - 'administrators'
      - 'domain admins'
      - 'enterprise admins'
      - 'schema admins'
  condition: selection
falsepositives:
  - 'Domain admin troubleshooting tools'
  - 'Security tools performing access reviews'
level: medium
