title: System Information Discovery - T1082
id: a95abdb1-4464-4d29-be05-599f70723917
status: experimental
description: Detects common system information discovery commands used by adversaries for reconnaissance based on CERG Detection Engineering Framework
references:
  - https://attack.mitre.org/techniques/T1082/
author: CERG Detection Engineering Team
date: 2026-06-30
modified: 2026-06-30
tags:
  - attack.t1082
  - attack.system_information_discovery
  - attack.discovery
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains:
      - 'systeminfo'
      - 'msinfo32'
      - 'hostname'
  condition: selection
falsepositives:
  - 'Helpdesk remote troubleshooting'
  - 'Software inventory tools'
  - 'User-initiated system information lookups'
level: low
