title: Create Account - T1136
id: 135a1cc5-c3ec-46ab-9a4e-f156bb83ac25
status: experimental
description: Detects creation of new user accounts as a persistence technique based on CERG Detection Engineering Framework
references:
  - https://attack.mitre.org/techniques/T1136/
author: CERG Detection Engineering Team
date: 2026-06-30
modified: 2026-06-30
tags:
  - attack.t1136
  - attack.create_account
  - attack.persistence
logsource:
  category: authentication
  product: windows
detection:
  selection:
    EventID: 4720
  condition: selection
falsepositives:
  - 'IT helpdesk creating accounts for new hires'
  - 'Automated provisioning systems'
level: medium
