title: Unsecured Credentials - T1552
id: 89791082-5c8f-4084-9365-1c6da54c2b02
status: experimental
description: Detects command-line searches for credential-related files or registry keys based on CERG Detection Engineering Framework
references:
  - https://attack.mitre.org/techniques/T1552/
author: CERG Detection Engineering Team
date: 2026-06-30
modified: 2026-06-30
tags:
  - attack.t1552
  - attack.unsecured_credentials
  - attack.credential-access
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains:
      - 'passwords'
      - 'secrets'
      - 'credentials'
      - '.kdbx'
      - 'id_rsa'
      - 'vaultcmd'
  condition: selection
falsepositives:
  - 'IT audit or password rotation scripts'
  - 'Password managers performing lookups'
level: medium
